---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wood.WoodColor2
source: html/7ad7e5db-6f78-6431-3495-bde45a627e51.htm
---
# Autodesk.Revit.DB.Visual.Wood.WoodColor2 Property

The property labeled "Color 2" from the "Wood" schema.

## Syntax (C#)
```csharp
public static string WoodColor2 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.